9/data/attachments/f2bcaffa5a7756d7.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_058eefb2-d7a6-4289-8e9d-d1b68a887385</nif:username>
            <nif:friendToBeAdded>James_foot_Friend_55986_2</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>